app/views/preferences/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
      <p class="title">Grab some grub with:</p>
      <h2 id="vote-header"><%= User.find_by(id: @event.planner_id).full_name %> near <%=@event.street_address%>!</h2></br>