app/controllers/events_controller.rb

  def index
    session[:user_id] = current_user.id
    @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

  def create
    @user = User.find_by(id: current_user.id)
    @event = Event.new(street_address: params[:event][:street_address])

    if @event.save && params[:full_name] && params[:phone_number]
      @user.events << @event
      index = 0
      participant_count = params[:full_name].count
      participant_count.times do
        invitation = Invitation.new(full_name: params[:full_name][index], phone_number: params[:phone_number][index])
        if invitation.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "events" ("street_address", "planner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["street_address", "19480"], ["planner_id", 1], ["created_at", "2015-10-10 22:41:52.981713"], ["updated_at", "2015-10-10 22:41:52.981713"]]
INSERT INTO "invitations" ("full_name", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["full_name", "pri"], ["phone_number", "3q5"], ["created_at", "2015-10-11 01:15:21.619121"], ["updated_at", "2015-10-11 01:15:21.619121"]]