app/controllers/preferences_controller.rb

  def create
    p "IN CREATE"
    p params
    event = Event.find_by(id: params[:event_id])
    p "FOUND EVENT!!!"
    @preference = Preference.new(preference_params)
    p "AFTER Preference"
    other_params
    p "AFTER OTHER PARAMS"
    if @preference.cuisine == ""
      @preference.cuisine = nil
    end
    p "AFTER F"
    if @preference.distance != nil
      meter_conversion(@preference.distance)
    end
    p "AFTER G"
    values = [@preference.is_fancy, @preference.cuisine, @preference.is_vegetarian, @preference.distance]
    p "AFTER H"
    filter_count = 0
    values.each do |value|
      if value != nil
        filter_count+=1
      end
    end
     p "BEFORE SAVE!!!!!"
    if filter_count <= 2 && @preference.save
---
INSERT INTO "preferences" ("price", "cuisine", "participant_id", "event_id", "vegetarian", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["price", ""], ["cuisine", "italian"], ["participant_id", 2], ["event_id", 1], ["vegetarian", "t"], ["created_at", "2015-10-11 03:01:08.018228"], ["updated_at", "2015-10-11 03:01:08.018228"]]